diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>InformationRegister.ВКМ_УведомленияКлиентов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ВКМ_Подразделения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбоненскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_По</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения()

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот, 0) КАК ПроцентОтРабот,
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
	|ПОМЕСТИТЬ ВТ_ПроцентПоСотруднику
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудников.Сотрудник
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	|	ДоговорыКонтрагентов.Наименование КАК Наименование,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеПоДоговору
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
	|		И ВКМ_ОбслуживаниеКлиента.Клиент = ДоговорыКонтрагентов.Владелец
	|		И ВКМ_ОбслуживаниеКлиента.Организация = ДоговорыКонтрагентов.Организация
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|	И (ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот МЕЖДУ ДоговорыКонтрагентов.ВКМ_ПериодС И ДоговорыКонтрагентов.ВКМ_По
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоДоговору.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы,
	|	ВТ_ПроцентПоСотруднику.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	ВТ_ПроцентПоСотруднику КАК ВТ_ПроцентПоСотруднику,
	|	ВТ_ДанныеПоДоговору КАК ВТ_ДанныеПоДоговору";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не верная дата!");
		
	
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Для Каждого Сторока Из ВыполненныеРаботы Цикл
			
		СуммаКОплате = Выборка.ВКМ_СтоимостьЧасаРаботы * Сторока.ЧасыКОплатеКлиенту;
		
		КонецЦикла;
		
	КонецЦикла;
	
		
		
КонецЕсли;
	
	Для Каждого ТекСтрокаВыполненныеРаботы Из ВыполненныеРаботы Цикл
	
         //ВыполненныеСотрудникомРаботы
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту * Выборка.ВКМ_СтоимостьЧасаРаботы * Выборка.ПроцентОтРабот/100;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов;
		
		//Регистр ВыполненныеРаботыКлиенту
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
	    Движение.СуммаКОплате = СуммаКОплате;
		Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ЧасыКОплатеКлиенту;
		
	КонецЦикла;

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();

    

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
    
    Текст = СтрШаблон("Создан документ дата  %1, специалист %2", Дата, Специалист);
	СпрНовУвед = Справочники.ВКМ_УведомленияТГБот.СоздатьЭлемент();
	СпрНовУвед.Текст = Текст;
	СпрНовУвед.Записать();
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
